app/Controllers/Dashboard.php

    public function index()
    {

        $userModel = new UserModel();
        $loggedInUserId = session()->get('loggedInUser');
        $userInfo = $userModel->find($loggedInUserId);
        $db = db_connect();
        $db->close();


        $data = [
            'title' => 'Dashboard',
            'userInfo' => $userInfo,
            'outputArray' => $this->movimentModel->where('type', 'input')->findAll(),
            'inputArray' => $this->movimentModel->where('type','output')->findAll(),
            'fullArray' => $this->movimentModel->findAll(),
            'inputAll' =>$this->movimentModel->selectSum('value')->where('type','input')->findAll(),
            'outputAll' =>$this->movimentModel->selectSum('value')->where('type','output')->findAll(),
---
SELECT *
FROM `user`
WHERE `user`.`id` = '8'
SELECT *
FROM `moviment`
WHERE `type` = 'input'
SELECT *
FROM `moviment`
WHERE `type` = 'output'
SELECT *
FROM `moviment`
SELECT SUM(`value`) AS `value`
FROM `moviment`
WHERE `type` = 'input'
SELECT SUM(`value`) AS `value`
FROM `moviment`
WHERE `type` = 'output'