app/Controllers/Users.php

    public function index()
    {


        $userModel = new UserModel();
        $loggedInUserId = session()->get('loggedInUser');
        $userInfo = $userModel->find($loggedInUserId);
        if ($userInfo['type'] == 'admin'){
        $dados = [
            'title' => 'Users',
            'userAll' => $userModel->findAll(),
---
SELECT *
FROM `user`
WHERE `user`.`id` = '1'
SELECT *
FROM `user`

    public function buttons(){
        $uri = current_url(true);
        $idUsers = $uri->getSegment(4);
        $this->usersModel->delete(['id' => $idUsers]);
---
DELETE FROM `user`
WHERE `id` IN ('11')

    public function form(){
        $userModel = new UserModel();
        $loggedInUserId = session()->get('loggedInUser');
        $userInfo = $userModel->find($loggedInUserId);
---
SELECT *
FROM `user`
WHERE `user`.`id` = '1'